# Напишите программу, которая принимает на вход два числа 
# и проверяет, является ли одно число квадратом другого.

# in 5 , 25 -> Yes;   in 25 , 5 -> Yes;
# in 4 , 16 -> Yes;   in 8 , 9 -> No;

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))

if a * a == b or b * b == a:
    if a < b:
        print('"Yes" a является квадратом b')   
    else:
        print('"Yes" b является квадратом a')
else:
    print('"No" a не является квадратом b')

    